todo/app/controllers/todo_items_controller.rb

  def destroy
    @todo_item.destroy
---
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 2]]

  def complete
    if !@todo_item.completed?
      @todo_item.update_attribute(:completed_at, Time.now)
---
UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", "2016-02-27 12:46:52.102546"], ["updated_at", "2016-02-27 12:46:52.104559"], ["id", 4]]