todo/app/controllers/todo_lists_controller.rb

UPDATE "todo_lists" SET "description" = ?, "updated_at" = ? WHERE "todo_lists"."id" = ?  [["description", "Second descr"], ["updated_at", "2016-02-27 13:40:16.580711"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)